#include <stdio.h>
#include <stdlib.h>

#include "error_types.h"
#include "stack.h"

static const size_t starting_capacity = 1;

int main()
{
    INIT(stk1);
    StackCtor(&stk1, starting_capacity);
//FIXME придумать различные тесты-проверки
//1-------------------------------------------------------------------------------------------------
//Попытка вызвать Pop, когда стек пустой + проверка реаллокации
    StackPush(&stk1, 10);
    StackPush(&stk1, 20);
    StackPush(&stk1, 30);

    StackPop(&stk1);
    StackPop(&stk1);
    StackPop(&stk1);
    StackPop(&stk1);
//1-------------------------------------------------------------------------------------------------

//2-------------------------------------------------------------------------------------------------

//2-------------------------------------------------------------------------------------------------
    StackDtor(&stk1);
    return 0;
}
